Python 3.13.7 (tags/v3.13.7:bcee1c3, Aug 14 2025, 14:15:11) [MSC v.1944 64 bit (AMD64)] on win32
Enter "help" below or click "Help" above for more information.
#리스트 연산#
a=[1,2,3]
b=[4,5,6]
a+b
[1, 2, 3, 4, 5, 6]

a = [1,2,3]
a * 3
[1, 2, 3, 1, 2, 3, 1, 2, 3]

#리스트 길이 구하기#
a = [1,2,3]
len(a)
3

#리스트 수정#
a = [1,2,3]
a[2] = 4
a
[1, 2, 4]

#del 함수 사용 #
a = [1,2,3]
del a[1]
a
[1, 3]

a= [1,2,3,4,5]
del a[2:]
a
[1, 2]

#appnd 추가 함수 #
a = [1,2,3]
a.append(4)
a
[1, 2, 3, 4]

a.append([5,6])
a
[1, 2, 3, 4, [5, 6]]
[1, 2, 3, 4, [5, 6]]
[1, 2, 3, 4, [5, 6]]

#리스트 정렬 - sort#

a= [1,4,3,2]
a.sort()
a
[1, 2, 3, 4]

a = ['a','c','b']
a.sort()
a
['a', 'b', 'c']
['a', 'b', 'c']
['a', 'b', 'c']

#리스트 뒤집기 - reverse #
a = ['a','c', 'b']
a.reverse()
a
['b', 'c', 'a']

#인덱스 반환 - index#
a = [1,2,3]
a.index(3)
2

#리스트에 요소 삽입 -  insert #
a = [1,2,3]
a.insert(0,4) ## a[0]위치에 4 삽입##
a
[4, 1, 2, 3]

a
>>> a.insert(3,5)
>>> a
[4, 1, 2, 5, 3]
>>> 
>>> #리스트 요소 제거 - remove #
>>> a = [1,2,3,1,2,3]
>>> a.remove(3)
>>> a
[1, 2, 1, 2, 3]
>>> ##첫 번째 3만 제거된다##
>>> 
>>> a.remove(3)
>>> a
[1, 2, 1, 2]
>>> 
>>> #리스트 요소 끄집어 내기 - pop #
>>> a = [1,2,3]
>>> a.pop()
3
>>> a
[1, 2]
>>> #맨 마지막 요소를 리턴하고 그 요소는 삭제한다.)
>>> 
>>> #x번째 요소 리턴#
>>> a.pop(1)
2
>>> a
[1]
>>> 
>>> #리스트에 포함된 요소 x의 개수 세기 - count#
>>> a = [1,2,3,1]
>>> a.count(1)
2
>>> 
>>> #리스트 확장 - extend #
>>> a = [1,2,3]
>>> a.extend([4,5])
>>> a
[1, 2, 3, 4, 5]
